app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17')  ORDER BY release_date
SELECT "movies".* FROM "movies"  ORDER BY release_date
---
    def index
      # general all ratings for index html
      @all_ratings = Movie.all_ratings
      # set heading coloring options to false
      @coloring_title, @coloring_rd = false, false

      # set movies to check boxed movies
      if params.has_key?(:ratings)
        @checked = params[:ratings]
        @movies = Movie.where(rating: @checked.keys)
        @checked_ratings = @checked
      else
        @checked_ratings = @all_ratings
        @movies = Movie.all

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Stuart Little 🐌"], ["rating", "NC-17"], ["release_date", "2016-06-09 00:00:00.000000"], ["created_at", "2021-10-03 21:39:37.862385"], ["updated_at", "2021-10-03 21:39:37.862385"]]
---
    def create
      @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["release_date", "2016-03-02 00:00:00.000000"], ["updated_at", "2021-10-03 23:28:41.481159"], ["id", 14]]
---
    def update
      @movie = Movie.find params[:id]
      @movie.update_attributes!(movie_params)